{"pageProps":{"codelog":{"tags":["devtools","react"],"title":"2019-04-27","content":"<h2>Plan for the day</h2>\n<ul class=\"contains-task-list\">\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> Continue watching - <a href=\"https://frontendmasters.com/courses/chrome-dev-tools-v2/\">Mastering Chrome Developer Tools, v2</a> by Jon Kuperman.</li>\n</ul>\n<h2>Learned today</h2>\n<ul>\n<li>This one is not related to my current FE class, but I read today that React.js has a neat way to avoid props hell when a n-th child of the component needs some value from it. Instead of passing it via props through the chain of all children components, you can use <em>Context</em> to make it available to all components in the tree (like a global variable). It's especially helpful when certain props are used by multiple children components.</li>\n</ul>\n<h3>\"Elements\" tab (cd.)</h3>\n<ul>\n<li>\n<p><em>Computed</em> tab shows the final state of styles after browser parsed all the CSS. You can hover on a property and there will be an arrow next to the value. Clicking on it will take you to the actual source of that rule.</p>\n<p><img src=\"/img/codelogs/computed-style-source.png\" alt=\"Computed style source\"></p>\n</li>\n<li>\n<p><em>Event listeners</em> tab is helpful in debugging performance issues, e.g. for slow scroll performance you could check the list of all <code>scroll</code> listeners and their source code.</p>\n</li>\n<li>\n<p>CSS allows different color formats to specify color of an element. You can change the displayed format by pressing and holding Shift key and then clicling on a color swatch.</p>\n<p><img src=\"/img/codelogs/color-formats.png\" alt=\"Color formats\"></p>\n</li>\n</ul>\n<h3>\"Sources\" tab</h3>\n<ul>\n<li>\n<p>Bottom left corner of the source code editor has a button which will pretty print minified production code.</p>\n<p><img src=\"/img/codelogs/pretty-print.png\" alt=\"Pretty print\"></p>\n</li>\n<li>\n<p>Chrome is using files collected in <code>localhost</code>, but you could add a folder with the actual source code and browser will try to map the source and <code>localhost</code> files. This way any changes saved in the browser will be also saved in your codebase. To do that, go to the <em>Filesystem</em> tab and add your project folder (you will have to allow Chrome to write to disk). Afterwards you will see some (or all) files and rules having green dots at their icons, which means they've been mapped to source code and all changes to those will persist.</p>\n<p><img src=\"/img/codelogs/add-to-workspace.png\" alt=\"Add to workspace\"></p>\n<p>Modyfing DOM structure and elements (e.g. changing <code>div</code> into <code>p</code>, changing the order of elements) in the <em>Elements</em> tab will <strong>not</strong> be saved to disk (you're editing DOM which is not the source, but an output of parsed source).</p>\n<p>Modifying CSS in a project using a CSS preprocessor like SaSS <strong>will work</strong> <code>&#x3C;gasp></code>!!</p>\n</li>\n<li>\n<p>After selecting a node in <em>Elements</em> and going to Console, the selected node will be available under <code>$0</code> variable. Selecting another node will make that available under <code>$0</code> and the previously selected node will be <code>$1</code>. The history will go up to <code>$4</code>.</p>\n</li>\n<li>\n<p>DevTools provide jQuery selectors even if you don't explicitly use jQuery.</p>\n</li>\n</ul>\n<h4>Breakpoints</h4>\n<ul>\n<li>To set a breakpoint you can either:<ul>\n<li>manually type <code>debugger</code> in your code before the line you want the breakpoint on and refresh the page with DevTools open,</li>\n<li>open the file in the <em>Sources</em> tab, click on the line number (with actionable code) and get a blue arrow on it.</li>\n</ul></li>\n<li>You can also set conditional breakpoints by right-clicking on a code line, selecting <em>Add conditional breakpoints</em> and typing a condition in the box. Such breakpoints are marked in orange.</li>\n<li>Breakpoints do <strong>not</strong> travel back in time, only move forward.</li>\n</ul>\n<ul>\n<li>\n<p>The right-hand panel has the following tabs:</p>\n<ul>\n<li>\n<p><em>Watch</em> allows you to put any expression (one or more variables) and monitor its state (if it's been defined in the scope).</p>\n</li>\n<li>\n<p><em>Call stack</em> explains \"How did we get here?\"</p>\n<ul>\n<li>If anything in the call stack is not important (e.g. comes from an external library or your app uses React and you'd like to see <code>setState</code>, not how React manipulates the DOM) you can right-click on that particular line and select <em>Blackbox script</em>.</li>\n<li>You can also enable global blackboxing via <em>Three dots menu > Settings > Blackboxing</em>.</li>\n<li>Call stack allows you to step back and forth through time (unlike breakpoints).</li>\n<li><strong>Tip</strong>: while you are in call stack you can use <em>Watch</em>!</li>\n</ul>\n</li>\n<li>\n<p><em>Scope</em> tells you exactly what you have access to at this time. It might get a bit messy with many DOM APIs, so you might prefer to watch for specific variables via <em>Watch</em>.</p>\n</li>\n<li>\n<p><em>Breakpoints</em> lists all breakpoints. Click on a checkbox next to a breakpoint to deactivate it or right-click for more options (delete, disable, deactivate, etc.).</p>\n</li>\n<li>\n<p><em>XHR / fetch breakpoints</em> are breakpoints set on fetching specific URL(s). They are very useful combined with <em>Call stack</em> and <em>Watch</em> for monitoring internal variables .</p>\n</li>\n<li>\n<p><em>DOM breakpoints</em> shows all breakpoints which you can set by right-clicking on a DOM element and selecting the <em>Break on</em> option in the context menu. Useful in a situation when you know something is modifying DOM, but you do not know what and where.</p>\n<p>Available options are:</p>\n<ul>\n<li>subtree modifications (which element inside of the tree is modifying the element?),</li>\n<li>attribute modifications (what is modifying data attribute, class, id, etc.?),</li>\n<li>node removal (what is deleting the element?).</li>\n</ul>\n</li>\n<li>\n<p><em>Global listeners</em></p>\n</li>\n<li>\n<p><em>Event listener breakpoints</em></p>\n</li>\n</ul>\n</li>\n</ul>\n<h2>Resources list</h2>\n<ul>\n<li><a href=\"https://reactjs.org/docs/context.html\">React.js context docs</a></li>\n</ul>\n<h2>Other resources</h2>\n"}},"__N_SSG":true}