{"pageProps":{"codelog":{"tags":["devtools"],"title":"2019-04-24","content":"<h2>Plan for the day</h2>\n<ul class=\"contains-task-list\">\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> Continue watching - <a href=\"https://frontendmasters.com/courses/chrome-dev-tools-v2/\">Mastering Chrome Developer Tools, v2</a> by Jon Kuperman.</li>\n</ul>\n<h2>Learned today</h2>\n<ul>\n<li>You can use Chrome DevTools as <strong>IDE</strong> (<code>&#x3C;insert screaming face emoji here></code>)!!</li>\n<li>Pressing <code>escape</code> key on any tab (except console) opens \"Console drawer\".</li>\n</ul>\n<h3>\"Elements\" tab</h3>\n<ul>\n<li>Press <code>opt / alt</code> key and click the expand arrow of any DOM node to expand all the children nodes.</li>\n<li>Right-click on a node and pick \"Scroll into view\" to move focus into that element -- especially helpful for infinite scroll websites.</li>\n<li>In CSS editor, clicking on any color swatch opens color panel. Click on the 2nd set of arrows opens color palette, from where you can pick some pre-defined nice palettes (e.g. <em>Material Design</em>) or custom palette based on current colors of the website. Long-click on any color opens up options with multiple shades.</li>\n<li>You can click on a node and press <code>h</code> to hide the element. (it behaves like <code>visibility: hidden</code>, i.e. keeps space in DOM). Pressing <code>delete</code> key removes the element completely from DOM.<ul>\n<li>Having a specific selector on that element with <code>visibility: visible !important</code> overrides the <code>h</code> shortcut.</li>\n</ul></li>\n<li>You can trigger various states of element, e.g. <code>hover</code>. With an element highlighted, click on <code>:hov</code> button where you can simulate element state.</li>\n</ul>\n<h2>Resources list</h2>\n<ul>\n<li><a href=\"https://developers.google.com/web/tools/chrome-devtools/\">Chrome DevTools official documentation</a></li>\n</ul>\n<h2>Other resources</h2>\n"}},"__N_SSG":true}